src/InformationRegisters/СоставСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыФормированияСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыФормированияСегментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПериодическиОбновлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормироватьВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/СоставСегментов/Forms/ФормаСпискаПоОбъектуСегмента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектСегмента", Параметры.ОтборПоОбъектуСегмента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
// Процедура - обработчик события "Выбор" табличного поля.
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Сегмент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "СписокПриАктивизацииСтроки" табличного поля.
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура обработчик команды УдалитьИзСегмента
//
Процедура УдалитьИзСегмента(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьИзСегментаЗавершение", ЭтотОбъект), СтрШаблон(НСтр("ru='Вы хотите удалить ""%1"" из сегмента ""%2"" ?';en='Do you want to delete ""%1"" from segment ""%2"" ?'"), Элементы.Список.ТекущиеДанные.ОбъектСегмента, Элементы.Список.ТекущиеДанные.Сегмент), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды ДобавитьВСегмент
//
Процедура ДобавитьВСегмент(Команда)
	
	Если ТипЗнч(Параметры.ОтборПоОбъектуСегмента) = Тип("СправочникСсылка.Номенклатура") Тогда
		ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ИначеЕсли ТипЗнч(Параметры.ОтборПоОбъектуСегмента) = Тип("СправочникСсылка.Контрагенты") Тогда
		ОткрытьФорму("Справочник.СегментыКонтрагентов.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ДобавитьВСегментЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьИзСегментаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Элементы.Список.ТекущиеДанные = Неопределено И РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьИзСегментаНаСервере(Элементы.Список.ТекущиеДанные.Сегмент);
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
// Процедура обновляет видимость и активность элементов формы.
//
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.ДобавитьВСегмент.Доступность = Истина;
	Элементы.УдалитьИзСегмента.Доступность = Истина;
	
	Если Элементы.Список.ТекущиеДанные = Неопределено 
			ИЛИ Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.СегментСпособФормирования <> ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную") Тогда
		Элементы.ДобавитьВСегмент.Доступность = Ложь;	
		Элементы.УдалитьИзСегмента.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура удаление контрагент из сегмента
//
// Параметры:
//		Сегмент - Сегмент, с которого удалять контрагента
//
Процедура УдалитьИзСегментаНаСервере(Сегмент)
	
	Если Сегмент.Пустая() Или Параметры.ОтборПоОбъектуСегмента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СоставСегментов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.ОбъектСегмента = Параметры.ОтборПоОбъектуСегмента;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
// Процедура добавление контрагент в сегмент
//
// Параметры:
//		Сегмент - Сегмент, в который добавить контрагента
//
Процедура ДобавитьВСегментНаСервере(Сегмент)
	
	Если Сегмент.Пустая() Или Параметры.ОтборПоОбъектуСегмента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СоставСегментов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сегмент = Сегмент;
	МенеджерЗаписи.ОбъектСегмента = Параметры.ОтборПоОбъектуСегмента;
	
	МенеджерЗаписи.Записать();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещенийАсинхронныхСобытий

// Процедура - Добавить в сегмент завершение
//
// Параметры:
//  Результат	 - Результат Оповещения
//  Параметры	 - Параметры Оповещения
//
&НаКлиенте
Процедура ДобавитьВСегментЗавершение(Результат, Параметры)  Экспорт
	
	Сегмент = Результат;
	Если Сегмент <> Неопределено Тогда
		ДобавитьВСегментНаСервере(Сегмент);
		ОбновитьВидимостьЭлементов();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
